/******************* (C) COPYRIGHT 2009~2021 holychip **************************
* File Name          : HC89F30xC_GeneralKey_Touch_Lib_CFG_H.h
* Author             : Touch Team
* Version            : V3.0.0.0    
* Date               : 2021/04/08
********************************************************************************

注：凡是HCTouchLib开头的宏定义，用户可以根据实际调试需要，修改后面的数据

*******************************************************************************/
#ifndef __HC89F30xC_GeneralKey_Touch_Lib_CFG_H__
#define __HC89F30xC_GeneralKey_Touch_Lib_CFG_H__


/*******************************************设置触摸相关寄存器*********************************************************************************/
	
//      设置数据采样时钟个数(0~255) 单个通道扫描时间 ≈ ((HCTouchLib_DSCR+1)*256 - 1)/(Fosc/2)
#define HCTouchLib_DSCR                                 50

//      设置触摸充电电源电压(0~3)   0->2v 1->2.5v 2->3v 3->4v，充电电压越大，触摸计数值越大
//      使用注意：必须保证芯片VDD电压 > 用户设置触摸充电电源电压+0.5V
#define HCTouchLib_VD                                   2

//      设置触摸放电电阻(3~6)       3->放电电阻最小, 6->放电电阻最大,方向3(小)-->6(大), 放电电阻越小,RawData值越小
#define HCTouchLib_RBS                                  3
	

/*******************************************设置触摸按键相关参数*******************************************************************************/

//      设置需要检测的通道个数 注意：此处个数必须设置正确，且与检测的通道标志对应，如果通道标志一共设置了6个，则此处必须填6，否则程序会运行出错
#define HCTouchLib_OPENED_TK_AMOUNT											2

//      设置需要检测的通道标志 ------>[0: 不检测；1: 允许检测]													
//      HC89F30xC--------->   			│TK0 │TK1 │TK2 │TK3 │TK4 │TK5 │TK6 │TK7 │TK8 │TK9 │TK10│TK11│TK12│TK13│TK14│TK15│TK16│TK17│TK18│TK19│TK20│
#define HCTouchLib_TK_CH_MASK			  {  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  1 ,  0 ,  0 ,  0 ,  1 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 }													
                                                                                                                                  
//      设置短按按键及长按按键 ------>[0: 短按按键  1: 长按按键]
//      使用注意：本配置必须配合长/短按键生效最长时间使用
//      HC89F30xC--------->         │TK0 │TK1 │TK2 │TK3 │TK4 │TK5 │TK6 │TK7 │TK8 │TK9 │TK10│TK11│TK12│TK13│TK14│TK15│TK16│TK17│TK18│TK19│TK20│
#define HCTouchLib_TK_LONGKEY       {  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 }	

//      手指触摸值(25~65535)  
//      HC89F30xC--------->         │TK0 │TK1 │TK2 │TK3 │TK4 │TK5 │TK6 │TK7 │TK8 │TK9 │TK10│TK11│TK12│TK13│TK14│TK15│TK16│TK17│TK18│TK19│TK20│
#define HCTouchLib_FINGER_THRESHOLD { 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200}	
	
//      确认按键有效值比例(40~1000) Differ>手指触摸值*确认按键有效值比例/100后按键生效
#define HCTouchLib_CONFIRM_TOUCH_RATIO									70
	
//      确认按键无效值比例(20~1000) Differ<手指触摸值*确认按键无效值比例/100后按键失效
#define HCTouchLib_CONFIRM_NOTOUCH_RATIO								20		
	
//      触摸有效上限值(0~255)       上限值 = HCTouchLib_LIMIT_FACTOR × 对应通道的触摸阈值，0表示不设置上限
#define HCTouchLib_LIMIT_FACTOR													0	

//      按键确认消抖次数(1~255)     按下消抖时间 = 单个按键扫描时间 × 开启的检测通道个数 × 按键确认消抖次数
#define HCTouchLib_CONFIRM_TOUCH_TIME										2

//      按键离开消抖次数(1~255)     松开消抖时间 = 单个按键扫描时间 × 开启的检测通道个数 × 按键离开消抖次数
#define HCTouchLib_CONFIRM_NOTOUCH_TIME									2
	
	

/*******************************************设置基线更新相关参数*******************************************************************************/
//                                                                   Differ																	 																	 														 
//      一轮扫描时间 = 单个通道扫描时间 × 开启的检测通道个数            ↑					
//      区域I，区域II，区域IV 的更新时间 ≈ 设置值 × 一轮扫描时间   │         │
//      区域III的微调原理 ：│Differ累加值│ > 设置值 时 基线微调    │         │
//-----------------------------------------------------------------│---------│----------------------------------------触摸有效上限值
//      设置短按键生效最长时间(0~2000)                             │         │Differ>触摸阈值+迟滞时，内部计数器累加值
#define HCTouchLib_CONFIRM_SHORTTOUCH_TIME              0       // │         │超过区域I设置值后，按键无效，更新基线																			 
//                                                                 │    I    │      
//      设置长按键生效最长时间(SHORTTOUCH_TIME~65535)              │         │																	 
#define HCTouchLib_CONFIRM_LONGTOUCH_TIME               0       // │         │																			 
//                                                                 │         │																		 
//-----------------------------------------------------------------│---------│----------------------------------------触摸阈值
//      设置正基准线更新时间(0~65535)                              │         │Differ在0与触摸阈值之间时，内部计数器累加	
#define HCTouchLib_OVERZERO_TIME                        100     // │   II    │值超过区域II设置值后，按键无效，更新基线	         															 
//                                                                 │         │																			 
//-----------------------------------------------------------------│---------│----------------------------------------0
//      设置低基准线复位时间(0~255)                                │         │Differ<0时，内部计数器累加值超过区域IV设置
#define HCTouchLib_OVERLOW_TIME                         100     // │   IV    │值后，按键无效，更新基线	   																				
	
	

/****************************************************************************************************/

#endif /*__HC89F30xC_GeneralKey_Touch_Lib_CFG_H__*/

/******************************************************************************************************
 * Revision history:
 *
 * Revision 1.01	2017/12/18 14:10 Taboo.Z
 * Revision 1.0.2.0	2018/07/20 16:26 Jing.L
 * Revision 1.0.3.0	2018/09/10 14:26 Jing.L
 * Add: 1、增加了迟滞参数
 *		2、删除了部分寄存器参数及调试参数
 *		3、整体重新排版
 * Revision 1.0.4.0	2019/03/06 10:44 Touch Team
 * Add: 1、删除了部分寄存器参数及调试参数
 *		2、HCTouchLib_CONFIRM_LONGTOUCH_TIME程序中可动态修改
 * Revision 1.0.5.0	2019/09/17 19:24 Touch Team
 * Add: 1、HCTouchLib_TK_CH_MASK由16进制改为2进制输入
 *		2、部分参数描述修改
 * Revision 2.0.0.0	2020/05/29 15:29 HA Team
 * Add: 1、根据HC89F30xC芯片特性增加硬件抗干扰使能
 *		2、触摸阈值与噪声阈值格式修改
 *      3、毛刺命名修改，修改为触摸有效上限值
 *      4、增加长短按键，长短按键的按键有效时间可以分别设置
 *      5、低基准线复位最长有效时间缩短
 * Revision 3.0.0.0	2021/04/08 10:41 HA Team
 * Add: 1、删除硬件抗干扰使能
 *		2、确认按键有效/无效值比例
 *      3、删除噪声相关参数
 *      4、删除充放电频率
 *
 ******************************************************************************************************/
